# Análisis de la información
Dentro de este notebook se analizarán los datos dentro del excel compartido en la plataforma Canvas.

In [13]:
#Importamos las librerias necesarias para poder analizar el excel
import pandas as pd

Observamos el contenido de las primeras cinco filas

In [14]:
data = pd.read_excel('db.xls')
data.head(3)

    Usuario Nombre Completo  ... Tipo de contrato Tipo de jornada
0  U1174488               A  ...       Indefinido     Mixta
1  U1202277               B  ...       Indefinido   Mixta
2  U1174527               C  ...       Indefinido    Diurna

[3 rows x 15 columns]

## Cantidad de vacantes por ubicación

In [15]:
Vacante = data.loc[data['Vacante'] == True].groupby('Ubicación').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()
Vacante
#Terminacion = data.loc[data['Estado del Empleado'] == 'Con terminación de contrato'].groupby('Ubicación').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()

                   Ubicación  Usuario
0                  Guatemala    17812
1                El Salvador    11625
2                 Costa Rica     2576
3                   Honduras      956
4       República Dominicana      572
5                     México      395
6                  Nicaragua       51
7  Estados Unidos de América       37
8                   Barbados        2
9                     Panamá        1

## Cantidad de empleados que sí pertenecen al sindicato por ubicación

In [16]:
no_Sindicato = data.loc[(data['Pertenece a Sindicato'] == 'Si') & (data['Vacante'] == False)].groupby('Ubicación').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()
no_Sindicato

              Ubicación  Usuario
0             Nicaragua       13
1            Costa Rica       10
2             Guatemala        8
3           El Salvador        7
4              Honduras        5
5  República Dominicana        2

## Cuantas personas hay por tipos de contratos

In [17]:
jornada = data.groupby('Tipo de contrato').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()
jornada

     Tipo de contrato  Usuario
0          Indefinido    64776
1  Tiempo determinado      396
2            A Plazo       346
3           No Aplica        1
4     Individual             1

## Departamentos con más empleados

In [28]:
departamentos = data.loc[data['Vacante'] == True]
departamentos = departamentos.groupby('Nombre Departamento').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()
departamentos[:5]

                         Nombre Departamento  Usuario
0  Operaciones Pollo Campero / Telepizza CAD     1125
1                                  Área Fría      361
2                          Pollo Campero 115      340
3                          Pollo Campero 118      338
4                          Pollo Campero 683      329

## Contrataciones por año

In [18]:
data['Ultima contratación'] = data['Fecha de Última Contratación'].apply(lambda x: x.year)
contrataciones = data.groupby('Ultima contratación').count()[['Usuario']].sort_values('Usuario', ascending = False).reset_index()
contrataciones[0:5]

   Ultima contratación  Usuario
0               2019.0     8643
1               2017.0     7817
2               2018.0     7644
3               2016.0     7583
4               2015.0     5654